tutorials/coriolisABLFoam/modifiedKepsilon/windVeering_FengAndGu2020_zeroGradient_fe32/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }

    top
    {
        type            symmetryPlane;
    }
    bottomRoughWall
    {
        type            epsilonWallFunction;
        Cmu             0.03;
        kappa           0.41;
        E               9.8;
        value           uniform 1;
    }
    sideLeft
    {
        type            zeroGradient;
    }
    sideRight
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
