tutorials/coriolisABLFoam/modifiedKepsilon/windVeering_FengAndGu2020_zeroGradient_fe32/system/ABLDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      ABLDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

coriolisSetup
{
    omega	0.086213;
    latitude	51.;
}

gradP
{
    ug	15.5;
    vg  0.;
}

// ************************************************************************* //
